movie = {
    "overview and data",
    "actors" : [
      {
        "overview and data",
        "movies": [
          {
            "overview and data",
            "actors": [{
              "overview and data",
              "movies" : [
                {
                  "overview and data",
                  "actors": [
                    {
                      "overview and data"
                    }
                  ]
                }
              ]
            }]
          }
        ]
      }
    ]
}

const data = {
  "id": 261747,
  "title": "مملكة الحرير",
  "adult": false,
  "backdrop_path": "/jVGOGDOKZU7F5YH8EmiqPwtJcsE.jpg",
  "budget": 0,
  "homepage": "",
  "original_language": "ar",
  "original_title": "مملكة الحرير",
  "origin_country": "{EG}",
  "overview": "ثلاثة إخوة تفرّقهم الدنيا، لكن بيجمعهم صراع قوي على عرش المملكة.\nكل حاجة بتتغير في يوم ميلاد الابن التاني للملك \"نور الدين\"، لما عمّهم المعروف بـ\"العم الذهبي\" يغدر بأخوه ويقتله، وبيبدأ يطارد ولاد الملك علشان يخلّي العرش ليه.\n\nالخادم المخلص \"رضوان\" بياخد الأميرين \"شمس الدين\" و\"جلال الدين\" وبيهرب بيهم، لكن في وسط الهروب بيتفرقوا عن بعض.\nشمس الدين بيتربى كعبد جوه كتيبة من الجنود، أما جلال الدين فبينشأ وسط عالم اللصوص.\n\nوبعد سنين، القدر بيرجع يجمّعهم، لكن مش كأخوات... كخصوم في معركة فيها كل حاجة: ولاء، خيانة، ودم، والكل بيحارب علشان يوصل للسلطة.",
  "popularity": 5.8255,
  "poster_path": "/5QOjymYM35JKSLGDLf57NEOUKny.jpg",
  "release_date": "2025-06-29T00:00:00.000Z",
  "status": "Returning Series",
  "runtime": 0,
  "revenue": 0,
  "type": "tv",
  "vote_average": 0,
  "video": null,
  "revenue_last_update": "2025-07-01T00:00:00.000Z",
  "episodes": 10,
  "GenreMovie": [
    {
      "id": 1333,
      "genreId": 10759,
      "movieId": 261747,
      "Genre": {
        "id": 10759,
        "name": "حركة ومغامرة"
      }
    },
    {
      "id": 1334,
      "genreId": 10765,
      "movieId": 261747,
      "Genre": {
        "id": 10765,
        "name": "خيال علمي وفانتازيا"
      }
    }
  ],
  "MovieActor": [
    {
      "id": 86314,
      "name": "شمس الدين",
      "movieId": 261747,
      "actorId": 1197253,
      "order": 0,
      "Actor": {
        "id": 1197253,
        "name": "كريم محمود عبدالعزيز",
        "profile_path": "/lIIiYr9DUWFoBIMVwX10gM7XpuV.jpg",
        "department": "Acting",
        "bio": "ممثل مصري. ظهر للمرة الأولى سينمائيًا في الطفولة من خلال فيلم (البحر بيضحك ليه)، ومنذ عام 2000، بدأ المشاركة في بطولة عدد من الأفلام والمسلسلات التلفزيونية، فقدم من الأفلام (بحر النجوم، ساعة ونص، جوازة ميري، عش البلبل، عمر وسلوى)، وقدم للتلفزيون مسلسلات (محمود المصري، باب الخلق، جبل الحلال)",
        "birthday": "1985-06-15T00:00:00.000Z",
        "place_of_birth": "Cairo, Egypt",
        "gender": 2
      }
    },
    {
      "id": 86315,
      "name": "جلال الدين",
      "movieId": 261747,
      "actorId": 3548017,
      "order": 1,
      "Actor": {
        "id": 3548017,
        "name": "أحمد غزي",
        "profile_path": "/8pCh6auBMJAJSD8tJtuhYWk5rEZ.jpg",
        "department": "Acting",
        "bio": "ممثل مصري، درس إدارة الأعمال بجامعة ليدز بإنجلترا، بدأ أول خطواته في تحقيق شغفه بالتمثيل من خلال تجسيده لشخصية Mo في الفيلم القصير Walkout 1 الذي عُرض في لندن 2020، ولدى عودته لمصر شارك في موسم رمضان 2021 في ثلاث مسلسلات، هي الاختيار 2 مع كريم عبدالعزيز والمخرج بيتر ميمي، ليشارك بعدها في مسلسل الدراما النفسية 60 دقيقة، أمام ياسمين رئيس ومحمود نصر، وجسد شخصية الملياردير السعودي الشهير عدنان خاشقجي في مرحلة شبابه ضمن أحداث المسلسل البريطاني The Crown في جزئه الخامس، الذي يُعرض على منصة نتفليكس.",
        "birthday": "1998-05-30T00:00:00.000Z",
        "place_of_birth": "Egypt",
        "gender": 2
      }
    },
    {
      "id": 86316,
      "name": "جليلة",
      "movieId": 261747,
      "actorId": 1940138,
      "order": 2,
      "Actor": {
        "id": 1940138,
        "name": "أسماء أبو اليزيد",
        "profile_path": "/yJrsy7KLn86f01CM4TssTxa3VKq.jpg",
        "department": "Acting",
        "bio": "ممثلة مصرية، درست في كلية الفنون الجميلة، شاركت في عدد كبير من العروض المسرحية، من بينها (حلم بلاستيك، ضحك السنين) ومسرحية (خلطة السعادة السحرية) التي عرضت على مسرح الهناجر ونافست على جائزة الشيخ سلطان القاسمي لأفضل عرض مسرحي لعام 2016، كما لفتت الانظار بقوة من خلال أدائها لشخصية \"تقى\" في مسلسل (هذا المساء).",
        "birthday": "1980-07-10T00:00:00.000Z",
        "place_of_birth": "Egypt",
        "gender": 1
      }
    },
    {
      "id": 86317,
      "name": "الدهبي",
      "movieId": 261747,
      "actorId": 226470,
      "order": 3,
      "Actor": {
        "id": 226470,
        "name": "عمرو عبدالجليل",
        "profile_path": "/q7faQwMlN03QLJ29RXZImV1lXOM.jpg",
        "department": "Acting",
        "bio": "ممثل مصري. ولد في عام 1963 لعائلة من ست أطفال أحدهم هو توأمه (أيمن) ومن أشقائه السيناريست (طارق عبد الجليل).\n\nبدأ حياته الفنية عام 1986 بدور في مسرحية (البلدوزر) من بطولة (محمد نجم). عمله الثاني مباشرةً كان مع المخرج الكبير (يوسف شاهين) في فيلمه الثاني من ثلاثيته السكندرية (إسكندرية كمان وكمان) في إحدى أهم محطات حياته الفنية. ثالث أعماله فيلم (ضحك و لعب وجد و حب) الذي صدر في عام 1993 من بطولة النجم (عمرو دياب).\n\nبرغم البداية القوية استمر في عدد من الأدوار المساعدة لفترة طويلة بدأت منذ بداية التسعينات بدايةً من مسلسل (ومازال النيل يجري) في 1992 ثم بثلاثة أفلام في 1993 هي (ديسكو ديسكو، ضحك ولعب وجد وحب، ليه يا هرم)، في 1994 كان تعاونه الثاني والهام مع المخرج (يوسف شاهين) في فيلمه (المهاجر)، استمر بتقديم الأدوار المساعدة في عدد من الأعمال أهمها مسلسلات (هارون الرشيد 1997، رد قلبي _بدور الأمير إبراهيم زوج أنجي _ في 1998، رياح الشرق 1999، البحار مندى 2002، بنت من شبرا 2003، الناس في كفر عسكر 2003، محمود المصري 2004، ملح الأرض 2004) وفي فيلم (جمال عبد الناصر) 1999 بدور (زكريا محيي الدين)، وبدور شرفي عام 2005 في فيلم (دم الغزال).\n\nنقطة التحول المحورية في مسيرة (عمرو عبدالجليل) كانت عام 2007، شارك في هذا العام للمرة الثالثة مع (يوسف شاهين) في فيلمه الأخير (هي فوضى) الذي أخرجه بالاشتراك مع (خالد يوسف)، و في فيلم (خالد يوسف) الذي صدر في نفس العام (حين ميسرة) شارك بدور كوميدي هام بدور المواطن البسيط (فتحي)، أظهر الدور موهبة كوميدية عنده بشكل جديد على أداءاته السابقة، في نفس العام شارك أيضًا في (عندليب الدقي) مع (محمد هنيدي)، في 2008 شارك في الفيلم المستقل (الغابة)، وفي العام التالي اشترك مع (خالد يوسف) للمرة الثانية في فيلمه (دكان شحاتة). في 2010 كان ميعاده مع البطولة السينمائية المطلقة للمرة الأول في تعاونه الثالث مع (خالد يوسف) في الفيلم الكوميدي (كلمني شكرًا)، وفي العام التالي بطولة الفيلم الكوميدي (صرخة نملة) من سيناريو شقيقه (طارق عبدالجليل). في 2013 ظهر في مسلسل (الزوجة الثانية) بدور (عتمان العمدة)، في 2014 قام ببطولة الفيلم الكوميدي (سعيد كلاكيت). حتى عام 2015 شارك (عمرو عبد الجليل) في حوالي ثمانين عمل بين سينمائي و مسرحي و تليفزيوني.",
        "birthday": "1963-01-10T00:00:00.000Z",
        "place_of_birth": "Egypt",
        "gender": 2
      }
    },
    {
      "id": 86318,
      "name": "الجبل",
      "movieId": 261747,
      "actorId": 2217436,
      "order": 4,
      "Actor": {
        "id": 2217436,
        "name": "وليد فواز",
        "profile_path": "/gnBcsx6udsgTzJf3zEyoNIBxeC4.jpg",
        "department": "Acting",
        "bio": "ممثل مصري. تخرج في المعهد العالي للفنون المسرحية، قسم دراما ونقد مسرحي. بدأ حياته الفنية بتقديم عروض الستاند آب كوميدي. من أهم أعماله في الدراما التلفزيونية مسلسلات (قاتل بلا أجر، أهل كايرو، أبواب الخوف، رقم مجهول). جاءت شهرته الحقيقة بعد أداءه لشخصية (معتمد) في مسلسل (بدون ذكر أسماء)، ثم في مسلسل (السبع وصايا). شارك أيضاً في أفلام (زهايمر، المصلحة، بعد الطوفان).",
        "birthday": "1980-12-17T00:00:00.000Z",
        "place_of_birth": "Egypt",
        "gender": 2
      }
    },
    {
      "id": 86319,
      "name": "رضوان",
      "movieId": 261747,
      "actorId": 578041,
      "order": 5,
      "Actor": {
        "id": 578041,
        "name": "محمود البزاوي",
        "profile_path": "/zSEhTEA07ZE4xchHU5SDwOOytmr.jpg",
        "department": "Acting",
        "bio": "مؤلف و ممثل مصري ولد في مدينة المحلة الكبرى. شارك في تأليف بعض الأعمال الفنية منها مسلسل (الأدهم)، وقبلها فيلم (عشان ربنا يحبك) ومسلسل (لحظات حرجة) و المسلسل المثير للجدل (الريان).\n\nشارك في أداء بعض الأدوار المساعدة في العديد من الأفلام مثل (زكي شان، التعويذة). اشتهر بأداء دور الصعيدي مثل دوره في فيلم (صعيدي رايح جاي) و(همام في أمستردام)، قدم دور الشاعر الغنائي عبد الرحمن الأبنودي في مسلسل (العندليب).",
        "birthday": "1963-09-25T00:00:00.000Z",
        "place_of_birth": "Egypt",
        "gender": 2
      }
    },
    {
      "id": 86321,
      "name": "",
      "movieId": 261747,
      "actorId": 1164888,
      "order": 7,
      "Actor": {
        "id": 1164888,
        "name": "سلوى عثمان",
        "profile_path": "/75uA46kdbm9GdmR3a6TK2S8lFEC.jpg",
        "department": "Acting",
        "bio": "ممثلة مصرية. تخرجت ‏في كلية الآداب قسم اللغة الإنجليزية من جامعة القاهرة. بدأت مسيرتها الفنية منذ عام 1980، وعملت في الإذاعة والسينما والمسرح ‏والتلفزيون. من أهم أفلامها (هيستيريا، أيام السادات)، بينما في مجال الدراما التلفزيونية فمن أبرز أعمالها (زمن عماد الدين، ابن الأرندلي، سجن النساء، المال والبنون).",
        "birthday": "1959-03-20T00:00:00.000Z",
        "place_of_birth": "Egypt",
        "gender": 1
      }
    },
    {
      "id": 86323,
      "name": "",
      "movieId": 261747,
      "actorId": 4584797,
      "order": 9,
      "Actor": {
        "id": 4584797,
        "name": "يوسف عمر",
        "profile_path": "/8gFoUQbHRFHMuQievHjVIB4zezR.jpg",
        "department": "Acting",
        "bio": "مثل مصري، شارك بالتمثيل في عدد من الأعمال الفنية، نذكر منها، مسلسل أغلى من حياتي عام 2010، ومسلسل حرب أهلية عام 2021.",
        "birthday": null,
        "place_of_birth": "Egypt",
        "gender": 2
      }
    },
    {
      "id": 86326,
      "name": "Writer",
      "movieId": 261747,
      "actorId": 1382661,
      "order": -1,
      "Actor": {
        "id": 1382661,
        "name": "بيتر ميمي",
        "profile_path": "/zne5y60WZNUD1jEpbcUXRsESQeH.jpg",
        "department": "Directing",
        "bio": null,
        "birthday": null,
        "place_of_birth": null,
        "gender": null
      }
    },
    {
      "id": 86327,
      "name": "Director",
      "movieId": 261747,
      "actorId": 1382661,
      "order": -1,
      "Actor": {
        "id": 1382661,
        "name": "بيتر ميمي",
        "profile_path": "/zne5y60WZNUD1jEpbcUXRsESQeH.jpg",
        "department": "Directing",
        "bio": null,
        "birthday": null,
        "place_of_birth": null,
        "gender": null
      }
    }
  ],
  "ProviderMovie": [
    {
      "id": 17,
      "movieId": 261747,
      "providerId": 2,
      "Platform": {
        "id": 2,
        "name": "Yango Play",
        "poster_path": "https://play-lh.googleusercontent.com/oBlFyrN_naiw2_D0VTKrw1xCLUDsAtKt77vxJ-coyMVVfNTgmbPOtGId_WNU5oCjFwE",
        "link": "https://play.yango.com"
      }
    }
  ],
  "CompanyMovie": [
    {
      "id": 3526,
      "movieId": 261747,
      "companyId": 258444,
      "ProductionCompany": {
        "id": 258444,
        "poster_path": "/9uuf25kHkXBHxdTovhP6t21sIeF.png",
        "name": "Conquer Studios",
        "origin_country": "EG"
      }
    },
    {
      "id": 3527,
      "movieId": 261747,
      "companyId": 258445,
      "ProductionCompany": {
        "id": 258445,
        "poster_path": "/x4agz2MpvLjC38jOVnYIrNpxnKR.png",
        "name": "Synergy Plus",
        "origin_country": "EG"
      }
    }
  ],
  "Image": []
}